IDEA StatiCa Open Model
ConcreteCheckResult.ResultType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Check result type
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public CheckResultType ResultType { get; set; }
Public Property ResultType As CheckResultType
	Get
	Set
public:
property CheckResultType ResultType {
	CheckResultType get ();
	void set (CheckResultType value);
}
Property Value
Type: CheckResultType
See Also
Reference
ConcreteCheckResult Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace